import MIDAS from '../assets/newsIMG/midas2025/imgs/thumbnail/MIDAS_POST.webp'
import midasIMG1 from '../assets/newsIMG/midas2025/imgs/img1.png'
import midasIMG2 from '../assets/newsIMG/midas2025/imgs/img2.png'
import midasIMG3 from '../assets/newsIMG/midas2025/imgs/img3.png'

import CCT from '../assets/newsIMG/midas2025/imgs'
import cctIMG1 from '../assets/newsIMG/cct2025/imgs/cct2025(1).jpg'
import cctIMG2 from '../assets/newsIMG/cct2025/imgs/cct2025(2).jpg'
import cctIMG3 from '../assets/newsIMG/cct2025/imgs/cct2025(3).jpg'

const formatDate = (dateString) => {
    const date = new Date(dateString);

    return `${date.toLocaleDateString("en-GB", {
        day: "2-digit",
        month: "short",
    })}, ${date.getFullYear()}`;
};

export const news = [
    {
        id: 1,
        publisher: "The MIDAS Cambodia",
        slug: "MIDAS-on-batchII-2025",
        thumbnail: MIDAS,   
        headline: "ចូលរួមអបអរសាទរក្រុមឆ្នើមដែលទទួលបានជ័យជំនះក្នុងកម្មវិធី Next-Gen Engagement Program - Batch II របស់បណ្ឌិត្យសភាបច្ចេកវិទ្យាឌីជីថលកម្ពុជា",
        subtitle: "ក្រុមហ៊ុន Midass មានកិត្តិយសធំធេងក្នុងការជាដៃគូឧបត្ថម្ភ និងបាននាំមកជូននំឆ្ងាញ់ៗ និងកាដូពិសេសៗដល់អ្នកចូលរួមទាំងអស់ ដើម្បីជាកម្លាំងគាំទ្រការប្រកួតច្នៃប្រឌិតរបស់និស្សិតចំនួន 12 ក្រុម",
        article: "កម្មវិធី Next-Gen Engagement Program - Batch II ដែលរៀបចំដោយបណ្ឌិត្យសភាបច្ចេកវិទ្យាឌីជីថលកម្ពុជា បានបញ្ចប់ដោយជោគជ័យក្នុងបរិយាកាសពោរពេញដោយភាពរីករាយនិងការចូលរួមយ៉ាងសកម្មពីសំណាក់និស្សិតកម្មវិធីនេះមានគោលបំណងបង្កើនសមត្ថភាពនិងលើកទឹកចិត្តយុវជនឲ្យចូលរួមក្នុងការច្នៃប្រឌិតនិងអភិវឌ្ឍគំនិតថ្មីៗក្នុងវិស័យឌីជីថល។ ក្នុងអំឡុងពេលកម្មវិធី មាននិស្សិតចំនួន 12 ក្រុមបានចូលរួមប្រកួតប្រជែង ដោយនាំយកគម្រោង និងគំនិតប្លែកៗមកបង្ហាញ។ការប្រកួតបានប្រព្រឹត្តទៅយ៉ាងរស់រវើកមានទាំងការពិភាក្សា ការបង្ហាញនិងការប្តេជ្ញាចិត្តពីសំណាក់អ្នកចូលរួមដែលបង្ហាញពីសមត្ថភាពនិងការខិតខំបរឹងប្រែងយ៉ាងច្បាស់។ ជាផ្នែកមួយនៃការគាំទ្រកម្មវិធី ក្រុមហ៊ុន Midassបានចូលរួមជាដៃគូឧបត្ថម្ភ ដោយផ្តល់នូវនំឆ្ងាញ់ៗនិងកាដូពិសេសៗជូនដល់អ្នកចូលរួមទាំងអស់។ ការគាំទ្រនេះបានរួមចំណែកយ៉ាងសំខាន់ក្នុងការលើកទឹកចិត្ត និងបង្កើនកម្លាំងចិត្តដល់និស្សិតក្នុងការចូលរួមប្រកួតប្រជែង និងអភិវឌ្ឍគំនិតរបស់ពួកគេ។ នៅចុងបញ្ចប់នៃកម្មវិធី ក៏មានការអបអរសាទរយ៉ាងកក់ក្តៅចំពោះក្រុមឆ្នើមដែលទទួលបានជ័យលាភី បង្ហាញពីសមត្ថភាព ការខិតខំប្រឹងប្រែងនិងភាពច្នៃប្រឌិតខ្ពស់។ជ័យលាភីទាំងនេះមិនត្រឹមតែជាការស្គាល់សមត្ថភាពប៉ុណ្ណោះទេ ប៉ុន្តែថែមទាំងជាកម្លាំងជំរុញឲ្យពួកគេបន្តអភិវឌ្ឍខ្លួន និងចូលរួមក្នុងការបង្កើតអនាគតឌីជីថលរបស់ប្រទេសកម្ពុជា។ កម្មវិធី Next-Gen Engagement Program បន្តបញ្ជាក់ពីសារៈសំខាន់នៃការសហការរវាងស្ថាប័នអប់រំ និងវិស័យឯកជន ក្នុងការបង្កើតបរិយាកាសអប់រំដែលលើកទឹកចិត្តការសិក្សា ការស្រាវជ្រាវ និងការច្នៃប្រឌិត។ ជាមួយនឹងភាពជោគជ័យនៃ Batch II នេះ កម្មវិធីនឹងបន្តជាវេទិកាសំខាន់មួយសម្រាប់យុវជនកម្ពុជាក្នុងការអភិវឌ្ឍសមត្ថភាព និងរួមចំណែកក្នុងសង្គមឌីជីថលនាពេលអនាគត។",
        date: formatDate("2026-01-25"),
        image: [midasIMG1, midasIMG2, midasIMG3]
    },
    {
        id: 2,
        publisher: "ស៊ីស៊ីថាមស៍ | The Cambodia China Times",
        slug: "cct-on-batchII",
        thumbnail: CCT,
        headline: "និស្សិត CADT មួយក្រុមរៀបចំកម្មវីធី ដាក់បង្ហាញគម្រោងស្នាដៃនិស្សិត ដើម្បីបង្ហាញពី«នវានុវត្តន៍ និង គំនិតច្នៃប្រឌិត»",
        subtitle: "ក្រុមនិស្សិតនៃបណ្ឌិតសភាបច្ចេកវិទ្យាឌីជីថលកម្ពុជា(CADT) នឹងរៀបចំ កម្មវិធី​Next-Gen’s Day ដែលប្រព្រឹត្តទៅនៅថ្ងៃទី 15 និង 16 ខែកញ្ញា ឆ្នាំ​2025 នៅ មជ្ឈមណ្ឌលនវានុវត្តន៍ បណ្ឌិតសភាបច្ចេកវិទ្យាឌីជីថលកម្ពុជា (CADT) ដើម្បីបង្ហាញពីនវានុវត្តន៍ គំនិតច្នៃប្រឌិត និង ឥទ្ធិពលនៃការផ្លាស់ប្តូរ",
        article: "ភ្នំពេញ៖ ក្រុមនិស្សិតនៃបណ្ឌិតសភាបច្ចេកវិទ្យាឌីជីថលកម្ពុជា (CADT) នឹងរៀបចំកម្មវិធី Next-Gen’s Day នៅថ្ងៃទី១៥ និងទី១៦ ខែកញ្ញា ឆ្នាំ២០២៥ នៅមជ្ឈមណ្ឌលនវានុវត្តន៍ CADT ដើម្បីបង្ហាញពី នវានុវត្តន៍ គំនិតច្នៃប្រឌិត និងឥទ្ធិពលនៃការផ្លាស់ប្ដូរ។ កម្មវិធី Next-Gen’s Day ត្រូវបានរៀបចំឡើងដោយនិស្សិតនៃបណ្ឌិតសភាបច្ចេកវិទ្យាឌីជីថលកម្ពុជា ក្រោមការគាំទ្រពី ដេប៉ាតឺម៉ង់វិទ្យាសាស្ត្រកុំព្យូទ័រ។ កម្មវិធីនេះធ្វើឡើងក្នុងគោលបំណងបង្ហាញសមិទ្ធផលនិងគម្រោងរបស់សិស្ស-និស្សិត ដែលបានចូលរួមក្នុងកម្មវិធី Next-Gen Engagement Program-Batch II អស់រយៈពេល ៥សប្ដាហ៍កន្លងមក។ កម្មវិធីនេះនឹងប្រព្រឹត្តទៅដោយមានសកម្មភាពសំខាន់ៗមួយចំនួន៖ ថ្ងៃទី១ (១៥ កញ្ញា)៖ សាធារណជនអាចចូលរួមទស្សនាការធ្វើបទបង្ហាញរបស់ក្រុមនីមួយៗ ដែលនឹងបង្ហាញគំនិតថ្មីៗ និងដំណោះស្រាយលើបញ្ហាផ្សេងៗ។ ចំណែកឯ ថ្ងៃទី២ (១៦ កញ្ញា)៖ នឹងមានការតាំងបង្ហាញគម្រោងរបស់ក្រុមទាំង ១២ ព្រមទាំងមានការលេងហ្គេមកម្សាន្តដើម្បីឈ្នះរង្វាន់ជាច្រើន។ អ្នកចូលរួមក៏អាចពិភាក្សាជាមួយបុគ្គលិកដើម្បីទទួលបានព័ត៌មានទាក់ទងនឹង CADT និងជំនាញសិក្សានីមួយៗ។ នាពេលរសៀល ក៏នឹងមានការប្រកាសក្រុមជ័យលាភី និងប្រគល់រង្វាន់ដល់ក្រុមទាំង ៦ផងដែរ។ គម្រោងនីមួយៗត្រូវបានបង្កើតឡើងដោយសិស្ស-និស្សិត ដើម្បីដោះស្រាយបញ្ហាប្រចាំថ្ងៃដែលសិស្សានុសិស្ស សាលារៀន និងសហគមន៍កំពុងជួបប្រទះ ដោយពួកគេបានបង្កើតដំណោះស្រាយតាមបែបបច្ចេកវិទ្យា។ តាមរយៈការចូលរួមកម្មវិធីនេះ អ្នកចូលរួមនឹងមានឱកាស៖ ១.ទទួលបានការបំផុសគំនិតថ្មីៗពីអ្នកដឹកនាំបច្ចេកវិទ្យានាពេលអនាគតរបស់កម្ពុជា, ២. ទស្សនាស្តង់តាំងបង្ហាញគម្រោងទាំង ១២ ដែលប្លែកៗគ្នា និងចូលរួមលេងហ្គេមកម្សាន្ត, ៣. ស្វែងយល់បន្ថែមពីកម្មវិធីសិក្សានៅ CADT ក៏ដូចជាឱកាសអាហារូបករណ៍សម្រាប់ឆ្នាំសិក្សា ២០២៥-២០២៦, ៤. ផ្សារភ្ជាប់ទំនាក់ទំនងជាមួយសិស្ស-និស្សិត និងសហគមន៍បច្ចេកវិទ្យាដែលកំពុងរីកចម្រើន។គួរបញ្ជាក់ថា កម្មវិធីនេះនឹងប្រព្រឹត្តទៅនៅជាន់ទី៤ នៃមជ្ឈមណ្ឌលនវានុវត្តន៍នៅ CADT ដែលអនុញ្ញាតឱ្យសិស្ស-និស្សិត អាណាព្យាបាលសិស្សឬបុគ្គលដែលចាប់អារម្មណ៍នឹងបច្ចេកវិទ្យា នវានុវត្តន៍ ឬចង់ដឹងបន្ថែមពីបណ្ឌិតសភាបច្ចេកវិទ្យាឌីជីថលកម្ពុជា (CADT) ចូលរួមដោយសេរី៕",
        date: formatDate("2025-09-09"),
        image: [cctIMG1, cctIMG2, cctIMG3]
    },
    
];
